{
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\jest.config": "This file configures Jest to work with TypeScript files in a Node.js environment, specifying the test file patterns to match.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\index": "This file imports modules for creating a server, handling CORS, formatting JSON, creating a graph, and working with files. It initializes a server, sets up middleware, parses a codebase, simplifies the data, generates links, and writes the data to JSON files. It defines routes for creating a graph, retrieving graphs, and running tests. The server runs on port 8001 and serves the application.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\calls": "This file includes functions to clean and split content, capture queries, classes for variable assignment, call identifier, and call, as well as a class for capturing calls.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\codebase": "The file \"codebase.ts\" contains sub-components including classes ImportName, ImportStatement, Node, and Codebase, along with an interface Link. It also imports functions from \"utils\" and constants from \"consts\", uses a class CallsCapturer, and imports modules like \"node:fs/promises\", \"path\", and \"tiktoken\" for encoding purposes.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\consts": "This file exports allowed types, excluded folders and extensions, supported languages, language extension map, new class methods map, itself class map, index suffixes map, and tree-sitter comment types for various programming languages.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\utils": "This file includes functions to get a list of files in a folder, calculate the total size of files, retrieve Tree-Sitter parser and queries for a language, capture queries using Tree-Sitter, clean captures, rename source names, find the first consecutive dots in a string, clean and split content, and get a called node from imported files.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\c": "This file contains queries for extracting information from Java code, including import statements, class definitions, assignments, definitions templates, constructor definitions, export clauses, and calls. It also includes special cases for assignments and extra assignment code.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\index": "The file \"index.ts\" exports language queries for JavaScript, TypeScript, Python, Java, and C, and defines an interface for tree-sitter queries.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\java": "This file contains queries for parsing Java code, including import statements, class definitions, method definitions, member expressions, arguments, and assignments. It defines tree-sitter queries for import statements, assignments, definitions template, constructor definitions, export clauses, extra assignment code, calls, and any assignments.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\javascript": "This file contains queries for extracting information from JavaScript code, including import statements, global assignments, function and class definitions, export clauses, and calls to classes, methods, and functions. It provides specific queries for import statements, assignments, definitions, export clauses, and calls, including handling special cases like member expressions and keyword arguments. The file also includes a template for function and arrow function definitions, as well as handling async functions and classes.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\python": "This file contains Tree-sitter definition queries for Python, including import statements, global assignments, function and class definitions, class and function calls, method and self.parameter calls, class extensions, Pydantic-like parameters, and typed parameters and return types of methods and functions. It also includes special cases for assignments, constructor definitions, and calls. The file provides detailed queries for identifying various components in Python code.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\typescript": "This file contains Tree-sitter definition queries for Typescript, including import statements, global assignments, function, class, interface, and enum definitions, export clauses, and specific queries for TypeScript such as constructor definitions, interfaces, enums, type aliases, and type exportables. It also handles assignment special cases, calls, and assignments to ensure correct parsing of TypeScript code.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\create_graph-test": "This file contains a POST endpoint that validates and processes a request to create a graph based on a repository. It verifies the user's access token, retrieves user information, fetches the necessary data from the repository, and generates a graph representation of the codebase, including nodes and links.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\create_graph": "The file \"create_graph.ts\" contains a function \"createGraph\" that handles POST requests to create a graph based on repository information, validating the request, verifying JWT token, accessing database, and initiating graph creation process. Additionally, there is an async function \"processGraphCreation\" that processes the graph creation in the background.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\graphs": "This file contains a route handler for updating a graph, which requires authentication via JWT. It retrieves graph information from a SQL database, checks for updates in the repository, and updates the graph status accordingly. If the graph is already up to date, it returns a success message; otherwise, it updates the graph and returns a message indicating the update process. Additionally, it defines an interface `UpdateGraph` and an `updateGraph` function to handle the graph update logic.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\bitbucket\\refresh-token": "This file contains a function named `refreshAccessToken` that takes a `refreshToken` as a parameter and returns a promise.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\db": "This file exports a constant `sql` which connects to a PostgreSQL database using the configuration provided by environment variables.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\git": "This file contains functions for downloading and extracting a repository, getting commit information, retrieving access tokens, and getting commit hash for different Git services like GitHub, GitLab, and Bitbucket. It also includes functions for refreshing access tokens specific to GitLab and Bitbucket, as well as calculating the total size of a repository.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\gitlab\\refresh-token": "This file contains a function named `refreshAccessToken` that asynchronously refreshes an access token using a provided refresh token.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\utils": "This file contains a constant object `ENV_VARS` with various database and authentication environment variables, and a function `getEnv` that retrieves a specific environment variable based on the key provided.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\wiki\\wiki2": "This file contains types, constants, and functions for generating documentation for nodes, files, and folders in a codebase. It includes functions for reading JSON files, building a call graph, performing a breadth-first search, generating node documentation, classifying and documenting files, and generating folder documentation. The file also defines utility functions for finding file parents and calculating elapsed time.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\c.test": "This file contains tests for importing statements, assignments, function definitions, struct definitions, union definitions, header files, and function calls in C code, utilizing classes like Node, ImportStatement, and Codebase to parse and analyze the code structure, generating expected outputs for each test case.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\java.test": "This file contains tests for importing statements, class definition, code without body, and method calls in Java code. The tests cover generating import statements, resolving import paths, simplifying node attributes, getting children definitions, and resolving method calls within a codebase.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\javascript.test": "This file contains tests for importing statements, assignments, function definitions, class definitions, and method calls in TypeScript and JavaScript code. It covers scenarios like generating import statements, resolving paths, parsing export clauses, simplifying node attributes, and getting calls between methods and classes.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\python.test": "This file contains tests for parsing Python code to extract import statements, assignments, function definitions, class definitions, code without body, and calls. The tests cover scenarios like resolving import paths, generating import statements, simplifying node attributes, getting children definitions, and resolving calls between nodes in a codebase.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\utils.test": "This file contains tests for the functions `cleanAndSplitContent` and `renameSource` in the `utils` module, testing different scenarios for renaming source modules in TypeScript and Python. Additionally, it includes tests for capturing specific elements like import statements and constructor definitions in JavaScript/TypeScript and Python.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\wiki": "This file contains functions to read nodes from a JSON file, process files and folders to generate summaries, create file and folder summaries, get summaries of the entire repository, build final markdown and wiki content, and improve the wiki content. It also includes a type definition for wiki nodes and initialization of an OpenAI client."
}