{
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\jest.config": "This file configures Jest to work with TypeScript files in a Node.js environment, specifying the test file patterns to match.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\index": "The file sets the server port to 8001, imports the Node.js \"fs\" module, initializes a Hono application with JSON formatting and CORS middleware, defines routes for creating graphs and fetching data, and implements a route to parse a codebase, simplify data, generate links, and write results to JSON files.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\calls": "This file includes functions to clean and split content, capture queries, classes for variable assignment, call identifier, and call, as well as a class for capturing calls.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\codebase": "This file includes classes ImportName, ImportStatement, Node, and Codebase, along with an interface Link. It also imports various utilities, constants, and the encoding_for_model function from \"tiktoken\" to assign the result to the variable enc.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\consts": "The file \"consts.ts\" defines various constants and mappings related to programming languages and file extensions, including arrays of excluded folders and extensions, language-specific mappings for class methods and context keywords, and mappings of file extensions to programming languages. It also imports tree-sitter parsers for JavaScript, Python, TypeScript, TSX, Java, and C, and defines an array of comment types used in conjunction with these parsers.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\utils": "The file \"utils.ts\" includes functions for retrieving a list of files in a folder based on specified criteria, calculating the total size of matching files, obtaining Tree-Sitter parser and queries for a language, capturing queries from Tree-Sitter, cleaning captures, and renaming source names. Additionally, it provides functions for processing content, identifying called nodes, and handling consecutive dots in a string.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\c": "This file defines tree-sitter queries for Java, including import statements, class definitions, assignments, definitions template, constructor definitions, and calls. It also includes functions for generating specific code snippets and exports empty export clauses.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\index": "The file \"index.ts\" exports an object `languageQueries` containing queries for different programming languages like JavaScript, TypeScript, Python, Java, and C, which are imported from separate files. The file also exports an interface `treeSitterQueries`.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\java": "This file contains tree-sitter queries for Java, including import statements, class definitions, method invocations, and variable assignments. It defines structures for import statements, assignments, definitions, constructor methods, and exports, with placeholders for modifiers, return types, names, parameters, and bodies. Additionally, it includes an empty function for extra assignment code and a template for variable declarators.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\javascript": "The file \"javascript.ts\" contains tree-sitter queries for JavaScript, including import statements, global assignments, function and class definitions, export clauses, and calls to classes, methods, and functions. It defines specific patterns for assignments, import statements, constructor definitions, export clauses, and calls, utilizing tree-sitter queries imported from './index'.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\python": "Import `treeSitterQueries` from './index' to access the `anyAssignments` assignment, which defines a template for matching and capturing information related to assignments and function definitions. The \"calls\" assignment includes definitions for various types of calls and parameters. The `extraAssignmentCode` function generates a specific code snippet based on the provided name. The `constructorDefinitions` assignment defines templates for function and class definitions, while the \"definitionTemplate\" defines a template for function definitions. The `assignments` assignment defines an expression statement module for assignments. The `importStatements` template string contains different import statement types for tree-sitter queries.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\typescript": "This file provides Tree-sitter definition queries for Typescript, including import statements, global assignments, function, class, interface, and enum definitions, and export clauses. It extends JavaScript queries for constructor definitions, interfaces, enums, and type aliases, and includes specific rules for calls, assignments, and extra assignment codes.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\create_graph-test": "Uses zod for schema validation, the `repoRequestValidator` function validates a JSON object with properties `git_provider`, `repo_org`, `repo_name`, `branch`, and `connection_id`, ensuring `git_provider` is one of 'github', 'gitlab', or 'bitbucket'. Assigns the value of the environment variable 'SUPABASE_JWT' to the variable 'secret' using the 'getEnv' function imported from '../utils/utils'. The `createGraphTest` instance defines a POST route that handles incoming requests, verifies authorization using JWT, retrieves user organization ID, fetches a git access token, downloads and extracts a repository, parses the codebase, simplifies the codebase structure, and returns a JSON response containing the graph nodes and links.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\create_graph": "The `processGraphCreation` function handles graph creation by processing codebase files, generating unique IDs, and updating the database. `repoRequestValidator` validates JSON objects. The 'secret' variable stores the value of the 'SUPABASE_JWT' environment variable.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\graphs": "This file contains a route handler for updating a graph, which requires authentication via JWT. It retrieves graph information from a SQL database, checks for updates in the repository, and updates the graph status accordingly. If the graph is already up to date, it returns a success message; otherwise, it updates the graph and returns a message indicating the update process. Additionally, it defines an interface `UpdateGraph` and an `updateGraph` function to handle the graph update process.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\bitbucket\\refresh-token": "Imports `getEnv` from \"../utils\". The function `refreshAccessToken` takes a `refreshToken` string as a parameter, sends a POST request to Bitbucket's OAuth2 endpoint to refresh the access token using the provided `refreshToken`, `client_id`, and `client_secret`. If successful, it returns an object with the new access token and refresh token; otherwise, it logs an error message and returns null.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\db": "The `sql` assignment connects to a PostgreSQL database using the `postgres` library with the provided configuration options, including the host, database name, port, username, password, connection settings, and SSL certificate from environment variables using the `getEnv` function imported from './utils'.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\git": "This file `git.ts` contains functions to interact with Git services like GitHub, GitLab, and Bitbucket, including downloading and extracting repositories, getting commit information, and managing access tokens. The `getCommitHash` function retrieves the commit hash based on the provider type, and the `MAXSIZE` constant is set to 2 MB.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\gitlab\\refresh-token": "This async function \"refreshAccessToken\" sends a POST request to the GitLab API to refresh the access token using the provided refresh token, utilizing the \"getEnv\" function to retrieve the GitLab app ID and secret ID, then returns a promise that resolves to an object containing the new access token and refresh token if successful; otherwise, logs an error message and returns null.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\utils": "`ENV_VARS` object contains various environment variables for database connection, Supabase configuration, GitLab integration, and Bitbucket integration. `getEnv` function retrieves a specific environment variable based on the provided key from the `ENV_VARS` object.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\wiki\\wiki2": "The file \"wiki2.ts\" contains functions and constants for processing and documenting nodes and files in a wiki structure. It includes functions for generating node and file documentation, building call graphs, and finding start nodes. Constants are set for API keys, file paths, and model settings. The file imports modules for file system operations, path handling, and external libraries like OpenAI.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\c.test": "This file contains tests for import statements, assignments, function, struct, union definitions, and calls in C code. It utilizes classes like `Node` and `ImportStatement` from the '../src/model/codebase' module, defining attributes and paths for code elements.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\java.test": "The file \"java.test.ts\" contains tests for import statements, class definition, code without body, and calls in Java code. It imports classes and attributes from \"../src/model/codebase\", defines `nodeAttributes` and `rootFolderPath`, and tests functionalities related to import statements, class structure, code extraction, and method calls within Java files.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\javascript.test": "The file at \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\javascript.test.ts\" contains tests for import statements, assignments, function definitions, class definitions, and calls in TypeScript, utilizing classes like `Codebase`, `Node`, `ImportStatement`, and `ImportName` from the '../src/model/codebase' module. The tests cover scenarios like generating imports, resolving import paths, parsing export clauses, simplifying node attributes, and extracting calls between nodes within the codebase.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\python.test": "This file contains tests for import statements, assignments, function definitions, class definitions, code without body, and calls in a Python file. It utilizes classes like `Codebase`, `Node`, `ImportStatement`, and `ImportName`, with attributes stored in `nodeAttributes` and `rootFolderPath` set to '/my/path'.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\utils.test": "This file contains tests for the functions `cleanAndSplitContent` and `renameSource` in the `utils` module, testing different scenarios for renaming source modules in TypeScript and Python. Additionally, it includes tests for capturing specific elements like import statements and constructor definitions in JavaScript/TypeScript and Python.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\wiki": "The file \"wiki.ts\" contains declarations of variables, imports of necessary modules, and functions for processing wiki nodes, files, and folders, including reading nodes, processing files and folders, creating summaries, and building markdown and wiki content based on the provided data and general summaries. It utilizes modules like `fs`, `path`, and `OpenAI` for file system operations, path manipulation, and AI functionalities."
}