{
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\jest.config": "This file configures Jest to use TypeScript for testing in a Node.js environment, matching test files with a specific pattern.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\index": "The file at \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\index.ts\" sets up a Hono application with middleware for JSON formatting and CORS, defines routes for codebase, repository, and graphs, and performs operations to parse, simplify, and write codebase data to JSON files. The \"port\" is assigned the value 8001, and the \"fs\" module is imported from Node.js for file system operations.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\calls": "This file includes functions to clean and split content, capture queries, classes for variable assignment, call identifier, and call, as well as a class for capturing calls.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\codebase": "This file includes an ImportName class, an ImportStatement class, a Link interface, a Node class, and a Codebase class. The \"enc\" variable is assigned the result of calling the \"encoding_for_model\" function from the \"tiktoken\" module with the argument \"gpt-4-turbo\".",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\consts": "The file \"consts.ts\" defines various constants and mappings related to programming languages and file processing. It includes arrays and objects for excluded folders and extensions, language parsers, language-to-extension mappings, class method names, class context keywords, and file index suffixes. Additionally, it imports tree-sitter parsers for JavaScript, Python, TypeScript, TSX, Java, and C to facilitate language-specific operations.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\utils": "The file \"utils.ts\" includes functions for retrieving files in a folder based on specified extensions, calculating the total size of files, obtaining Tree-Sitter parser and queries for a language, capturing queries from Tree-Sitter, cleaning captures, and renaming source names. Additionally, it contains functions for handling content cleaning and splitting, identifying consecutive dots in a string, and retrieving specific nodes based on import statements and call names.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\c": "Imports `treeSitterQueries` from './index' and defines `anyAssignments` as a tree-sitter query for declarations with identifiers or pointer declarators marked as '@left' and '@right'. The `calls` assignment captures call expressions with placeholders for function identifiers and arguments. `extraAssignmentCode` generates code snippets using a provided name parameter. `exportClauses` exports an empty string. `constructorDefinitions` contains definitions for functions, declarations, structs, and unions. `definitionTemplate` defines a template for functions or global assignments. `assignments` identifies declaration nodes within a translation unit. `importStatements` includes import statements for modules.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\index": "`index.ts` file exports an object `languageQueries` containing queries for JavaScript, TypeScript, Python, Java, and C programming languages, which are imported from separate files. The file also includes an interface `treeSitterQueries`.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\java": "This file contains tree-sitter queries for Java, including import statements, class definitions, constructor, method, and class declarations, variable declarators, method invocations, and a template for defining code elements with modifiers, return type, name, parameters, and body. The file also includes assignments, export clauses, and a function that returns an empty string.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\javascript": "The file \"javascript.ts\" contains tree-sitter queries for JavaScript code, including import statements, global assignments, function and class definitions, export clauses, and calls to functions, methods, and classes. It defines specific patterns for import statements, assignments, definitions, export clauses, and calls, utilizing the imported \"treeSitterQueries\" from './index' for code analysis and generation.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\python": "The file \"python.ts\" contains tree-sitter queries for Python, including import statements, global assignments, function and class definitions, class and function calls, method and self.parameter calls, class extensions, Pydantic-like parameters, and typed parameters and return types. It imports \"treeSitterQueries\" from './index' to access assignments, function definitions, and calls, providing structured templates for capturing information related to Python code elements.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\typescript": "This file contains Tree-sitter definition queries for Typescript, including import statements, global assignments, function, class, interface, and enum definitions, and export clauses. It extends JavaScript queries for constructor definitions, interfaces, enums, and type aliases, and includes a template for method and arrow function signatures. It appends function declarations, call information, and assignment details to existing strings, relying on imports from other files.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\create_graph-test": "Defines a validation schema \"repoRequestValidator\" using zod and @hono/zod-validator for JSON validation, validates properties git_provider, repo_org, repo_name, branch, and connection_id, with git_provider options 'github', 'gitlab', or 'bitbucket'. Assigns 'SUPABASE_JWT' environment variable value to 'secret' using 'getEnv' function from '../utils/utils'.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\create_graph": "The file \"create_graph.ts\" contains an async function `processGraphCreation` that handles graph creation in a database, utilizing SQL queries and the `Codebase` class. The `repoRequestValidator` validates JSON objects, and the 'secret' variable stores the value of the 'SUPABASE_JWT' environment variable.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\graphs": "This file contains a route handler for updating a graph, which requires authentication via JWT. It retrieves graph information from a SQL database, checks for updates in the repository, and updates the graph status accordingly. If the graph is already up to date, it returns a success message; otherwise, it updates the graph and returns a message indicating the update process. Additionally, it defines an interface `UpdateGraph` and an `updateGraph` function to handle the graph update logic.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\bitbucket\\refresh-token": "Imports `getEnv` from \"../utils\". The function `refreshAccessToken` takes a `refreshToken` string as a parameter, sends a POST request to Bitbucket's OAuth2 endpoint to refresh the access token using the provided `refreshToken`, `client_id`, and `client_secret`. If successful, it returns an object with the new access token and refresh token; otherwise, it logs an error and returns null.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\db": "The `sql` assignment connects to a PostgreSQL database using the `postgres` library, with configurations for host, database, port, user, password, connection timeouts, and SSL certificate from environment variables fetched using the `getEnv` function imported from './utils'.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\git": "This file includes functions for downloading and extracting repositories, getting commit information, and retrieving access tokens for GitHub, GitLab, and Bitbucket services. The `getCommitHash` function extracts the commit hash based on the provider platform, while `MAXSIZE` is assigned the value of 2.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\gitlab\\refresh-token": "Imports the `getEnv` function from \"../utils\" to retrieve the GitLab app ID and secret ID, then sends a POST request to \"https://gitlab.com/oauth/token\" with the provided `refreshToken` to refresh the access token. If successful, returns the new access and refresh tokens; otherwise, logs an error message and returns null.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\utils": "`ENV_VARS` object contains various environment variables for database connection, Supabase configuration, GitLab integration, and Bitbucket integration. `getEnv` function retrieves a specific environment variable based on the provided key.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\wiki\\wiki2": "The file \"wiki2.ts\" contains functions and constants for processing nodes and links data, interacting with OpenAI, and generating documentation for nodes, files, and folders. It includes functions for finding start nodes in a call graph, reading JSON files, building call graphs, performing breadth-first search, and generating documentation for nodes, files, and folders. Constants are defined for API keys, model settings, file paths, and other configurations.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\c.test": "This file contains tests for various functionalities related to C code parsing and analysis. It includes tests for import statements, assignments, function definitions, struct definitions, union definitions, header files, and function calls within C code files. The tests cover scenarios like generating imports, resolving import statements, getting children definitions, and identifying function calls. The `nodeAttributes` array defines attributes used in the `Node` class, and the `rootFolderPath` variable is set to `'/my/path'`.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\java.test": "The file at \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\java.test.ts\" contains tests for import statements, class definition, code without body, and calls in Java. It utilizes attributes from the `Node` interface and defines `nodeAttributes` array and `rootFolderPath` variable.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\javascript.test": "The file at \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\javascript.test.ts\" contains tests for import statements, assignments, function definitions, class definitions, and calls in TypeScript, utilizing classes like `Codebase`, `Node`, `ImportStatement`, and `ImportName`. The `rootFolderPath` variable stores the project's root path as `'/my/path'`.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\python.test": "This file contains tests for various functionalities related to parsing Python code, including import statements, assignments, function definitions, class definitions, code manipulation, and function calls within a codebase. The tests cover scenarios like generating import statements, resolving paths, simplifying node attributes, handling class methods, and identifying function calls. The file imports classes and attributes from the \"../src/model/codebase\" file and uses a root folder path '/my/path' for reference.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\utils.test": "The file \"utils.test.ts\" contains tests for the functions in the \"utils\" module. The tests cover the \"cleanAndSplitContent\" function for cleaning and splitting content, and the \"renameSource\" function for renaming source modules in JavaScript/TypeScript and Python. Additionally, there are tests for capturing different elements like import statements and constructor definitions in JavaScript/TypeScript and Python.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\wiki": "This file `wiki.ts` utilizes the `fs`, `path`, and `OpenAI` modules for file system operations, path manipulation, and interfacing with the OpenAI API. It defines a `wikiNode` type and includes functions for reading nodes, processing files and folders, creating summaries, and building markdown and wiki content based on the provided nodes and summaries."
}