{
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\jest.config": "This file configures Jest to use TypeScript for testing in a Node.js environment, matching test files with a specific pattern.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\index": "This file imports modules for creating a server, handling CORS, formatting JSON, creating a graph, and working with files. It initializes a server, sets up middleware, parses a codebase, generates nodes and links, writes data to JSON files, and serves the codebase information on a specified port.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\calls": "This file includes functions to clean and split content, capture queries, classes for variable assignment, call identifier, and call, as well as a class for capturing calls.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\codebase": "The file \"codebase.ts\" contains sub-components including classes ImportName, ImportStatement, Node, and Codebase, along with an interface Link. It also imports functions from \"utils\" and constants from \"consts\", uses a class CallsCapturer, and imports modules like \"node:fs/promises\" and \"tiktoken\".",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\consts": "This file defines allowed types for declarations, excluded folders and extensions, supported languages, language extension mappings, new class methods mappings, class itself mappings, index suffixes mappings, and TreeSitter comment types.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\\utils": "This file includes functions to get a list of files in a folder, calculate the total size of files, retrieve Tree-Sitter parser and queries for a language, capture queries using Tree-Sitter, clean captures, rename source names, find the first consecutive dots in a string, clean and split content, and get a called node from imported files.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\c": "This file contains Tree-sitter queries for Java code, including import statements, class definitions, assignments, definitions template, constructor definitions, export clauses, and calls. It also includes special cases for assignments and extra assignment code. The queries cover various elements such as member expressions, arguments, and method calls within classes.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\index": "The file \"index.ts\" exports languageQueries object containing queries for Javascript, Typescript, Python, Java, and C languages, and defines an interface treeSitterQueries.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\java": "This file contains queries for parsing Java code, including import statements, class definitions, method definitions, member expressions, arguments, and assignments. It defines tree-sitter queries for import statements, assignments, definitions template, constructor definitions, export clauses, calls, and any assignments necessary to get correct calls in Java code.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\javascript": "This file contains queries for extracting information from JavaScript code, including import statements, global assignments, function and class definitions, export clauses, and calls to classes, methods, and functions. It provides specific queries for import statements, assignments, definitions, export clauses, and calls, including handling special cases like member expressions and keyword arguments. The file also includes a template for function and arrow function definitions, as well as handling async functions and classes.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\python": "This file contains Tree-sitter definition queries for Python, including import statements, global assignments, function and class definitions, class and function calls, method and self.parameter calls, class extensions, Pydantic-like parameters, and typed parameters and return types of methods and functions. It also includes special cases for async functions, constructor definitions, and assignments where identifiers are present. The file provides detailed queries for various Python code elements to assist in parsing and analyzing Python code.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries\\typescript": "This file provides Tree-sitter definition queries for Typescript, including import statements, global assignments, function, class, interface, and enum definitions, as well as export clauses. It extends queries from JavaScript, handling interfaces, enums, and type definitions. Special cases like assignment names and type identifiers are considered for accurate calls.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\create_graph-test": "This file contains a POST endpoint that validates a JSON request, retrieves user information from a JWT token, fetches user organization ID from a database, obtains a Git access token, downloads and extracts a repository, parses the codebase, simplifies the codebase structure, and returns a JSON response containing the graph nodes and links.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\create_graph": "The file \"create_graph.ts\" contains a function \"createGraph\" that handles POST requests to create a graph based on repository information provided, including authentication, repository validation, and graph creation process. It also includes an async function \"processGraphCreation\" to handle the background task of graph creation.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes\\graphs": "This file contains a route handler for updating a graph, which requires authentication via JWT. It retrieves graph information from a SQL database, checks for updates in the repository, and updates the graph status accordingly. If the graph is already up to date, it returns a success message; otherwise, it updates the graph and returns a message indicating the update process. Additionally, it defines an interface `UpdateGraph` and an `updateGraph` function to handle the graph update process.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\bitbucket\\refresh-token": "This file contains a function named `refreshAccessToken` that takes a `refreshToken` as a parameter and returns a promise.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\db": "This file contains a function `sql` that connects to a PostgreSQL database using the provided environment variables for host, database name, port, username, password, and SSL certificate.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\git": "This file in \"git.ts\" contains functions for downloading and extracting a repository, getting commit information, retrieving access tokens, and handling commit hashes for GitHub, GitLab, and Bitbucket services. It also includes functions for refreshing access tokens specific to GitLab and Bitbucket, as well as utility functions for calculating total size.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\gitlab\\refresh-token": "This file contains a function named `refreshAccessToken` that asynchronously refreshes an access token using a provided refresh token.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\utils": "This file contains a constant object `ENV_VARS` with various database and authentication environment variables, as well as functions to retrieve specific environment variables using the `getEnv` function.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\wiki\\wiki2": "This file contains types, constants, and functions for generating documentation for nodes, files, and folders in a codebase. It includes functions for reading JSON files, building call graphs, performing breadth-first search, classifying and documenting files, and generating documentation for nodes, files, and folders. The file also defines utility functions for time calculations and tokenization.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\c.test": "This file contains tests for importing statements, assignments, function definitions, struct definitions, union definitions, header files, and function calls in C code. The tests cover generating import statements, parsing children definitions, simplifying nodes, resolving import paths, and identifying function calls within a codebase.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\java.test": "This file contains tests for importing statements, class definition, code without body, and method calls in Java code. The tests cover generating import statements, resolving import paths, simplifying node attributes, getting children definitions, and resolving method calls within a codebase.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\javascript.test": "This file contains tests for import statements, assignments, function definitions, class definitions, and calls in TypeScript and JavaScript code. It covers scenarios like generating import statements, resolving paths, parsing export clauses, simplifying node attributes, and getting calls between nodes. The tests ensure the correct functionality of the codebase model for analyzing and processing JavaScript and TypeScript files.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\python.test": "This file contains tests for parsing Python code to extract import statements, assignments, function definitions, class definitions, code without body, and calls between methods and classes. The tests cover scenarios like resolving import paths, simplifying node attributes, generating import statements, getting children definitions, and resolving calls within the codebase.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\\utils.test": "This file contains tests for the functions `cleanAndSplitContent` and `renameSource` in the `utils` module, testing different scenarios for renaming source modules in TypeScript and Python. Additionally, it includes tests for capturing specific elements like import statements and constructor definitions in JavaScript/TypeScript and Python.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\wiki": "This file contains functions to read nodes from a JSON file, process files and folders to generate summaries, create file and folder summaries, get summaries of the entire repository for context, build final markdown and wiki, and improve the generated wiki."
}