{
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts": "The folder \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\" includes files configuring Jest for TypeScript testing, initializing a Hono server with middleware and routes for codebase handling, classes for cleaning content and capturing queries, tree-sitter queries for Java, Python, TypeScript, PHP, and JavaScript, zod validation, graph creation and update handlers, database connections, GitLab functions, and tests for various languages, along with utilities for file processing, documentation generation, and environment variable retrieval.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src": "The folder contains files that handle server initialization, route definitions, code parsing, data extraction, and JSON file writing, including functions for content manipulation, query capture, node definition, and import statement handling. It defines classes and constants for language processing, imports tree-sitter parsers for JavaScript, Python, TypeScript, TSX, Java, C, and PHP, and includes queries for Java, PHP, Python, and TypeScript code. Additionally, it utilizes zod for validation, handles graph creation and updates, database connections, repository requests, access token refreshing, and GitLab API interactions, with functions for downloading repositories, extracting data, and documenting nodes and files in a wiki structure.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model": "The folder \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\" contains files with functions for cleaning, splitting content, capturing queries, defining nodes, import statements, variable assignment, call identification, and call capturing. It includes classes ImportName, ImportStatement, Link, Node, and Codebase, along with types NodeCallTuple. Defines constants, mappings for programming languages, file processing, arrays like `excludedFolders`, `excludedExtensions`, objects like `languageExtensionMap`, `newClassMethodsMap`, `itselfClassMap`, `indexSuffixesMap`, `languages`, and `treeSitterCommentTypes`. Imports tree-sitter parsers for JavaScript, Python, TypeScript, TSX, Java, C, and PHP. \"utils.ts\" file provides functions for file handling, size calculation, Tree-Sitter parser, query capture, content cleaning, and node extraction.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries": "The \"queries\" folder contains tree-sitter queries for Java, PHP, Python, and Typescript code, defining patterns and templates for import statements, assignments, definitions, calls, and special cases in each language, utilizing the `treeSitterQueries` import for parsing and processing code structures. The files include specific queries for various language components like class definitions, method invocations, function declarations, and space declarations, with attention to identifying member expressions, arguments, namespaces, and return types, ensuring accurate call identification and analysis.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes": "The folder \"routes\" contains files that utilize zod for validation, import z and zValidator from '@hono/zod-validator', define a repoRequestValidator function, assign the environment variable 'SUPABASE_JWT' to 'secret', handle POST requests for creating a graph, process graph creation in a database, validate repository requests, update a graph with JWT authentication, and define an interface and function for updating graphs.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\bitbucket": "This folder contains a file that imports `getEnv` from \"../utils\" and includes a function `refreshAccessToken` that refreshes the access token by sending a POST request to Bitbucket's OAuth2 endpoint using the provided parameters. If successful, it returns a new access token and refresh token object; otherwise, it logs an error message and returns null.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils": "The folder \"utils\" contains files for refreshing access tokens for Bitbucket and GitLab, connecting to a PostgreSQL database, handling Git operations, and retrieving environment variables for database and authentication configurations using the \"getEnv\" function.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\gitlab": "The \"refreshAccessToken\" async function in this folder sends a POST request to GitLab API to refresh the access token using a provided refresh token, leveraging the \"getEnv\" function to fetch GitLab app ID and secret ID, returning a Promise with new access token and refresh token if successful, or logging an error message and returning null otherwise.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\wiki": "The \"wiki\" folder contains a file named \"wiki2.ts\" that provides functions and constants for processing and documenting nodes and files in a wiki structure. It includes functions for finding start nodes in a call graph, reading JSON files asynchronously, tokenizing content using Tiktoken, and generating documentation for nodes and files, along with initializing variables for settings, paths, and API keys.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests": "The folder \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\" contains test files for C, Java, TypeScript, JavaScript, PHP, and Python codebases, covering import statements, assignments, function, struct, union, class definitions, namespaces, global variable assignments, code without body, calls, and various attributes. The tests utilize classes like `Codebase`, `Node`, `ImportStatement`, and `ImportName` from the '../src/model/codebase' module, defining variables such as `rootFolderPath`, `nodeAttributes`, and testing functions from the \"utils\" module for content splitting and source module renaming in JavaScript/TypeScript and Python."
}