{
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts": "The folder \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\" contains files configuring Jest for TypeScript testing, setting up a Hono application with middleware, defining routes, parsing codebase data, and handling various language-specific operations using tree-sitter parsers. It includes files for JSON validation, graph creation, updating graphs, refreshing access tokens, database connections, and processing code elements in JavaScript, Python, TypeScript, and Java. Tests cover functionalities like import statements, assignments, function definitions, and calls in C, Java, JavaScript, and Python, with utilities for content cleaning, splitting, and renaming. Additionally, there are files for interacting with OpenAI, generating documentation, and testing utility functions.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src": "The folder contains files for setting up a Hono application with middleware for JSON formatting and CORS, defining routes for codebase, repository, and graphs, parsing, simplifying, and writing codebase data to JSON files, handling constants and mappings for programming languages and file processing, retrieving files based on extensions, defining tree-sitter queries for JavaScript, Python, TypeScript, Java, and C, creating graphs in a database, updating graphs with authentication, refreshing access tokens, connecting to a PostgreSQL database, and processing nodes and links data for documentation generation.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model": "The folder contains files with functions for content manipulation, query capture, variable assignment, and class definitions, including ImportName, ImportStatement, Link, Node, and Codebase classes. The \"consts.ts\" file defines constants and mappings for programming languages and file processing, while \"utils.ts\" provides functions for file retrieval, size calculation, Tree-Sitter parser operations, query capture, and content handling.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries": "The folder \"queries\" contains tree-sitter queries for JavaScript, TypeScript, Python, Java, and C programming languages, including import statements, class, function, and method definitions, assignments, calls, export clauses, and code element templates, utilizing the \"treeSitterQueries\" module for code analysis and generation. The \"index.ts\" file exports language-specific queries and an interface, while individual language files like \"javascript.ts,\" \"python.ts,\" and Typescript queries extend the base queries for language-specific elements and patterns.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes": "The folder \"routes\" contains files that define a validation schema for JSON objects, handle graph creation in a database with SQL queries and the `Codebase` class, update graph information in a SQL database based on repository updates, and manage authentication via JWT for updating graphs, including logic for checking and updating graph status. It also includes functions for JSON validation, environment variable assignment, and graph update handling.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\bitbucket": "Folder \"bitbucket\" contains a file that imports `getEnv` from \"../utils\" and includes a function `refreshAccessToken(refreshToken: string)` that sends a POST request to Bitbucket's OAuth2 endpoint to refresh the access token using the provided parameters and returns a new access token and refresh token if successful; otherwise, it logs an error and returns null.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils": "The folder contains utility functions for refreshing access tokens for Bitbucket, connecting to a PostgreSQL database, handling GitLab and Bitbucket services, and retrieving environment variables for database connections, Supabase, GitLab, and Bitbucket integrations. It includes functions for refreshing access tokens, connecting to databases, extracting commit information, and fetching environment variables.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\gitlab": "This folder contains a file that imports the `getEnv` function from \"../utils\" to fetch GitLab app ID and secret ID, then makes a POST request to \"https://gitlab.com/oauth/token\" using the given `refreshToken` to renew the access token. It returns the updated access and refresh tokens upon success; otherwise, it logs an error message and returns null.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\wiki": "The \"wiki\" folder contains a file named \"wiki2.ts\" that includes functions and constants for processing nodes and links data, interacting with OpenAI, and generating documentation for nodes, files, and folders. It provides functionalities for finding start nodes in a call graph, reading JSON files, building call graphs, performing breadth-first search, and defining constants for API keys, model settings, file paths, and configurations.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests": "The folder \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests\" contains test files for C code parsing and analysis, Java, TypeScript, and Python functionalities, covering import statements, assignments, function definitions, class definitions, code manipulation, and function calls, utilizing various classes and attributes like `Node`, `Codebase`, `ImportStatement`, and `ImportName`. Tests include scenarios for generating imports, resolving paths, handling class methods, and identifying function calls, with a common `rootFolderPath` variable set to `'/my/path'` for reference."
}