{
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts": "The folder \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\" contains Jest configuration for TypeScript testing in Node.js and functions for reading nodes from JSON, processing files and folders to create summaries, generating markdown and wiki, and enhancing the wiki output.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src": "The files in this folder handle server creation, CORS, JSON formatting, graph creation, and file operations. They set up a server, manage middleware, parse codebases, create nodes and links, write JSON data, and serve codebase information on a designated port.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model": "The folder \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\" contains files with functions for cleaning and splitting content, capturing queries, variable assignment, call identification, and call capturing. The \"codebase.ts\" file includes sub-components like ImportName, ImportStatement, Node, Codebase, and Link interface, imports functions from \"utils\" and constants from \"consts\", uses CallsCapturer class, and imports modules \"node:fs/promises\" and \"tiktoken\". It defines allowed types, excluded folders/extensions, supported languages, mappings for methods, classes, and comment types, and functions for file operations, size calculation, Tree-Sitter parser, query capture, content manipulation, and node retrieval.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries": "The \"queries\" folder contains Tree-sitter queries for Java, JavaScript, Python, and Typescript code, covering import statements, class definitions, method definitions, member expressions, arguments, assignments, constructor definitions, export clauses, calls, and special cases like async functions and type identifiers. The \"index.ts\" file exports languageQueries for multiple languages and defines the treeSitterQueries interface.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes": "The folder \"routes\" contains files for handling POST requests to validate JSON, retrieve user information, fetch organization ID, obtain Git access token, download and parse repositories, simplify codebase structure, and return graph nodes and links. The \"create_graph.ts\" file includes functions for creating a graph based on repository information, authentication, validation, and background task handling. Another file manages updating graphs with authentication, SQL database retrieval, repository checks, and status updates, including an interface and function for the update process.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\bitbucket": "The \"bitbucket\" folder contains a file with a function `refreshAccessToken(refreshToken: string): Promise` that refreshes an access token using a provided refresh token.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils": "The folder \"utils\" contains files with functions for connecting to a PostgreSQL database, handling Git repositories (GitHub, GitLab, Bitbucket), managing access tokens, and calculating total size. It also includes environment variables and functions for retrieving specific variables.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\gitlab": "The folder \"gitlab\" contains a file with a function `refreshAccessToken` that asynchronously refreshes an access token using a provided refresh token.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\wiki": "The \"wiki\" folder contains types, constants, and functions for generating documentation for nodes, files, and folders in a codebase. It includes functions for reading JSON files, building call graphs, performing breadth-first search, classifying and documenting files, and generating documentation for nodes, files, and folders. Additionally, it defines utility functions for time calculations and tokenization.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests": "The folder \"tests\" contains files with tests for importing statements, assignments, function definitions, struct/class/union definitions, header files, method calls, and code analysis in C, Java, TypeScript, JavaScript, and Python, covering scenarios like generating/importing statements, resolving paths, simplifying node attributes, getting children definitions, and identifying calls within the codebase, ensuring correct functionality for analyzing and processing code files. Additionally, it includes tests for specific functions in the `utils` module for renaming source modules and capturing elements like import statements and constructor definitions."
}