{
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts": "The folder \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\" contains files configuring Jest for TypeScript testing, creating a server, handling CORS, parsing codebases, defining routes, capturing queries, exporting language queries, defining tree-sitter queries for various languages, creating graphs from repositories, updating graphs, refreshing access tokens, connecting to a PostgreSQL database, managing Git services, generating documentation, and conducting tests for code parsing and analysis in C, Java, TypeScript, JavaScript, and Python, as well as functions for processing files and folders, generating summaries, and improving wiki content.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src": "The folder contains files that handle server setup, code parsing, graph creation, and file manipulation, including functions for cleaning content, capturing queries, and extracting information from Java, JavaScript, Python, and TypeScript code. It exports language queries, tree-sitter definitions, and functions for creating and updating graphs based on repository data, as well as handling access tokens, database connections, and Git services. Additionally, it includes utilities for generating documentation, refreshing access tokens, and retrieving environment variables.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model": "The folder \"C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\model\" contains files with functions for cleaning and splitting content, capturing queries, variable assignment classes, call identifier and call classes, and a class for capturing calls. The \"codebase.ts\" file includes sub-components like ImportName, ImportStatement, Node, Codebase classes, and Link interface, imports functions from \"utils\" and constants from \"consts\", uses CallsCapturer class, and imports modules for encoding. It exports various types, folders, extensions, language support, class methods, index suffixes, and comment types for different programming languages, along with functions for file operations, size calculation, Tree-Sitter parser retrieval, query capturing, content manipulation, and node extraction from imported files.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\queries": "The \"queries\" folder contains files with queries for extracting and parsing information from Java, JavaScript, TypeScript, Python, and C code, including import statements, class definitions, assignments, method definitions, constructor definitions, export clauses, calls, and special cases like member expressions and async functions. The \"index.ts\" file exports language queries for JavaScript, TypeScript, Python, Java, and C, defining tree-sitter queries and handling various components in the respective languages for accurate parsing.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\routes": "The \"routes\" folder contains files for creating and updating graphs based on repository information. \"create_graph.ts\" includes functions for validating requests, verifying JWT tokens, accessing databases, and initiating graph creation, with an async function for background processing. The route handler in another file updates graphs, requiring JWT authentication, fetching graph data from a SQL database, checking for updates in the repository, and updating the graph status accordingly, with defined interfaces and functions for handling the update logic.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\bitbucket": "The \"bitbucket\" folder contains a file with a function `refreshAccessToken(refreshToken: string): Promise` that refreshes an access token using a provided refresh token.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils": "The folder \"utils\" includes functions for refreshing access tokens, connecting to a PostgreSQL database, downloading and extracting repositories, retrieving commit information, and calculating repository size. It also manages environment variables for database configuration and authentication.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\utils\\gitlab": "The folder \"gitlab\" contains a file with a function `refreshAccessToken` that asynchronously refreshes an access token using a provided refresh token.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\src\\wiki": "The \"wiki\" folder contains types, constants, and functions for generating documentation for nodes, files, and folders in a codebase. It includes functions for reading JSON files, building a call graph, performing a breadth-first search, generating node documentation, classifying and documenting files, and generating folder documentation. Utility functions for finding file parents and calculating elapsed time are also defined in this folder.",
  "C:\\Users\\gmasc\\OneDrive\\Documentos\\CodeGPT\\Graphs\\codebase-index-ts\\tests": "The folder \"tests\" contains files with tests for parsing and analyzing code structures in C, Java, TypeScript, JavaScript, and Python, covering scenarios like importing statements, assignments, function definitions, class definitions, method calls, and module renaming, utilizing classes like Node, ImportStatement, and Codebase to generate expected outputs for each test case."
}